
#求给定数的阶乘,所求阶乘的数不可以是这几个数：[1,10,20,30,40,50]

n=int(input('请输入一个正整数：'))
m=1
if n==1 or n==10 or n==20 or n==30 or n==40 or n==50:
	print('%d不能求阶乘' %(n))
else:
	for i in range(1,n+1):
		m=m*i
	print('%d的阶乘为%d' %(n,m))


#   单利公式为：单利=（P x T x R）/ 100其中，P是本金T是时间，R是利率
P=float(input('请输入：'))
R=float(input('请输入：'))
T=float(input('请输入：'))
V=(P*R*T)/100
print(V)

#  查找数组中的最大元素:[14,25,98,75,23,1,4,56,59]
l=[14,25,98,75,23,14,56,59]
l.sort()
print(l[-1])

'''
求数组中的前n个数的平方和：[14,25,98,75,23,1,4,56,59]
要求：n需要是input输入，且小于数组长度，不能固定。
'''
n=int(input('请输入一个整数：'))
l=[14,25,98,75,23,14,56,59]
sum=0
if n>len(l):
	print('超出数组长度')
else:
	for i in l[0:n+1]:
		sum=sum+i*i
print(sum)

'''
交换列表中的任意两个元素：[14,25,98,75,23,1,4,56,59]
要求，被置换的两个位置需要input输入。
'''
n=int(input('请输入：'))
m=int(input('请输入：'))
l=[14,25,98,75,23,1,4,56,59]
t=l[4]
y=l[5]
n,m==t,y
l=[14,25,98,75,n,m,4,56,59]
print(l)


