'''
1、	求给定数的阶乘
要求：所求阶乘的数不可以是这几个数：[1,10,20,30,40,50]
'''
L=[1,10,20,30,40,50]
x = 1
y = int(input("请输入要计算的数:"))
for i in range(1, y + 1):
   x = x * i
if y not in L:
    print(x)
else:
    print("无效数据")

'''
2、	单利公式为：单利=（P x T x R）/ 100其中，P是本金T是时间，R是利率
例如输入：P = 10000
      R = 5
      T = 5
输出：2500
要求:P、T、R都是input输入的，不能固定

'''
P = int(input("请输入本金："))
T = int(input("请输入时间："))
R = int(input("请输入利率："))
a =(P * T * R)/ 100
print("单利为：" and a)

'''
3、	查找数组中的最大元素:[14,25,98,75,23,1,4,56,59]
'''
L1 = [14, 25, 98, 75, 23, 1, 4, 56, 59]
print(max(L1))

'''
4、	求数组中的前n个数的平方和：[14,25,98,75,23,1,4,56,59]
要求：n需要是input输入，且小于数组长度，不能固定
'''
L2 = [14, 25, 98, 75, 23, 1, 4, 56, 59]
n=int(input("请输入n:"))
a = 0
b=len(L2)
if n < b:
    for i in L2[0:n]:
        a = a+(i*i)
    print("数组中的前n个位数的平方和为：%d" % (a))
else:
    print("n不能大于数组长度")

'''
5、	交换列表中的任意两个元素：[14,25,98,75,23,1,4,56,59]
要求，被置换的两个位置需要input输入
'''
L3 = [14, 25, 98, 75, 23, 1, 4, 56, 59]
a=int(input())
b=int(input())
L3[a],L3[b]=L3[b],L3[a]
print(L3)


