'''1、	求给定数的阶乘
要求：所求阶乘的数不可以是这几个数：[1,10,20,30,40,50]。
'''
k=1
a=int(input())
if a==1 or a==10 or a==30 or a==40 or a==50:
      pass
else:
      for x in range(1,a+1):
            k*=x
      print (k)

'''2、	单利公式为：单利=（P x T x R）/ 100其中，P是本金T是时间，R是利率
例如输入：P = 10000
      R = 5
      T = 5
输出：2500
要求:P、T、R都是input输入的，不能固定。
'''
P,T,R=map(int,input().split())
K=(P*T*R)/100
print(int(K))



'''3、	查找数组中的最大元素:[14,25,98,75,23,1,4,56,59]。'''
l1=[14,25,98,75,23,1,4,56,59]
l1.sort()
print(l1[-1])

'''4、	求数组中的前n个数的平方和：[14,25,98,75,23,1,4,56,59]
要求：n需要是input输入，且小于数组长度，不能固定。'''
l2=[14,25,98,75,23,1,4,56,59]
n=eval(input())
s=0
if n<len(l2):
     for k in l2[:n]:
         s+=k**2
print(s)

'''5、	交换列表中的任意两个元素：[14,25,98,75,23,1,4,56,59]
要求，被置换的两个位置需要input输入。
'''
l=[14,25,98,75,23,1,4,56,59]
a,b=map(int,input().split())
k=l[a-1]
m=l[b-1]
l[a-1]=m
l[b-1]=k
print(l)




