#求给定数的阶乘
#要求：所求阶乘的数不可以是这几个数：[1,10,20,30,40,50]。

def jc(x):
    if x < 0:
        return -1
    if x == 0:
        return 1
    return n * jc(x - 1)


⦁#单利公式为：单利=（P x T x R）/ 100其中，P是本金T是时间，R是利率
#例如输入：P = 10000
      #R = 5
      #T = 5
#输出：2500
#要求:P、T、R都是input输入的，不能固定。

P = int(input("输入本金:"))
R = int(input("输入利率:"))
T = int(input("输入时间:"))
print((P * T * R) / 100)

#⦁	查找数组中的最大元素:[14,25,98,75,23,1,4,56,59]。

print('最大的元素:'max(14,25,98,75,23,1,4,56,59))

#求数组中的前n个数的平方和：[14,25,98,75,23,1,4,56,59]
#要求：n需要是input输入，且小于数组长度，不能固定。

L = [14,25,98,75,23,1,4,56,59]
n = input('请输入一个数：')
def power(m):
    return m * m
print('前n个数 ='sum(map(power,L[:n]))

#交换列表中的任意两个元素：[14,25,98,75,23,1,4,56,59]
#要求，被置换的两个位置需要input输入。

L = [14,25,98,75,23,1,4,56,59]
a = input()
b = input()
x = 0
y = 0
x = L[a]
y = L[b]
L[a] = y
L[b] = x
print(L)

